import pygame
from pygame.draw import *
 
pygame.init()
 
FPS = 30
screen = pygame.display.set_mode((400, 400))
 
screen.fill("white")
polygon(screen,(255,205,125),[(0,0),(500,0),(500,70),(0,70)])#первый прямоугольник
polygon(screen,(248,215,186),[(0,70),(500,70),(500,140),(0,140)])#второй прямоугольник
polygon(screen,(255,205,125),[(0,140),(500,140),(500,210),(0,210)])#третий прямо
circle(screen,(255,255,0),(200,70),25)
polygon(screen,(255,144,0),[(0,140),(3,120),(45,115),(70,65),(80,68),(85,74),(130,120),(170,130)])
polygon(screen,(255,144,0),[(200,130),(235,110),(250,110),(260,90),(300,55),(320,90),(330,75),(350,80),(370,75),(420,90)])
polygon(screen,(138,51,36),[(0,140),(20,150),(40,210),(0,210)])
ellipse(screen,(138,51,36),(15,120,50,100))
polygon(screen,(138,51,36),[(50,210),(80,170),(90,190),(110,160),(150,170),(170,210)])
polygon(screen,(138,51,36),[(150,210),(150,190),(190,180),(230,140),(300,210)])
polygon(screen,(138,51,36),[(270,210),(250,190),(320,140),(330,150),(370,140),(380,170),(390,120),(500,60),(500,210)])
polygon(screen,(201,174,250),[(0,210),(500,210),(500,350),(0,350)])
polygon(screen,(0,0,0),[(0,170),(70,200),(110,300),(170,330),(180,330),(230,330),(280,290),(350,300),(380,210),(500,140),(500,500),(0,500)])
pygame.display.update()
 
clock = pygame.time.Clock()
finished = False
 
while not finished:
    clock.tick(FPS)
    for event in pygame.event.get():
        if event.type == pygame.QUIT:
            finished = True
 
pygame.quit()
